---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RoomDesignLightingLoadParam
source: html/71b8da35-e50f-d642-e71b-26be20f1d80a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RoomDesignLightingLoadParam Property

"Specified Lighting Load"

## Syntax (C#)
```csharp
public static ForgeTypeId RoomDesignLightingLoadParam { get; }
```